var koa = require( 'koa' );
var app = koa();

app.use( function *(){
    var ctx = this;
    var query = ctx.request.query;
    var rslt = 'nothing';

    if ( 'listdata' === query.mocktype ) {
        var date = null;
        rslt = [];

        for ( var i = 0; i != 6 ; i++ ) {
            date = ( new Date() ).getTime();
            rslt.push({
                title : date + "世界钢协：全球8月粗钢产量同比下降3%至1.32亿吨 中国减产3.5%",
                sourceSiteName : "钢铁行业网",
                source : "http://www.opsteel.cn/news/2015-09/1FD8F8EF52B97FC7E050080A7DC916E3.html",
                date : "2015.09.20",
                imgs : [
                    "http://img.china.alibaba.com/img/ibank/2013/586/305/984503685_1146405675.64x64.jpg"
                ],
                type : "oneSmallImg"
            });
        }
    } else if ( 'suggestdata' === query.mocktype ) {
        rslt = [];
        for ( var i = 0; i != 10 ; i++ ) {
            rslt.push('世界钢协');
        }
    } else if ( 'detail' == query.mocktype ) {
        rslt = {
            date: "2015-10-19 17:06",
            gmtModified: 1445252762000,
            id: 742,
            imgs: [ ],
            source: "http://news.mysteel.com/15/1019/17/155F69D494F0CC20.html",
            sourceSiteName: "我的钢铁网",
            title: "成品油调价姗姗来迟 本周二油价或迎小幅上调",
            type: "行业聚焦",
            content : 'xxxxxxx\r\nyyyyyyy\r\nGAN_GXUN_IMG:http://ww1.sinaimg.cn/bmiddle/61e8a1fdgw1ex7fagekktj20hd0ct764.jpg;355x190\r\nzzzzzz'
        };

        rslt.content = '前言：根据国际钢铁协会发布的统计数据，2014年全球粗钢产量达到16.62亿吨，同比增长1.2%，其中中国粗钢产量达到8.227亿吨，同比略增0.9%。从这组数据我们可以看出，目前中国粗钢产量占全球49.5%，但是我们的人口只占全球的20%左右。从人均粗钢产量消化量看，我们国家钢铁行业供大于求的情况十分严重，随着基础建设的逐渐完善，未来可能供应压力会日益加剧。\r\n' +
        '在这种背景下，笔者抽样调查了全国67家钢铁生产企业，多为国企，调查以提问方式电话调查为主，调查所得数据无作修饰，并加以分析，从钢厂负债率角度，预测未来可能淘汰的钢铁产能。\r\n' +
        '一、钢厂负债率普遍偏高，均值在68.35%。\r\n' +
        '数据显示，67家样本钢企负债率均值在68.35%，高于该数值的有45家钢企，占比约69%；低于该数值的仅22家，占比约34%。（如图1所示）\r\n' +
        '图1：67家钢企负债率情况\r\n' +
        'GAN_GXUN_IMG:http://img07.mysteelcdn.com/wz/uploaded/glinfo/2015/10/20/133045.jpg;424x294\r\n' +
        '    数据来源：上海钢联钢材事业部\r\n' +
        '数据同时显示，负债率超过100%的钢企一共有5家，占比8%。随着钢铁行业的不断恶化，这5家可能就是第一批面临淘汰的钢企，危险性极高。负债率在90%-99%的钢企一共有2家，占比3%。而负债率在60%-89%的钢企最多，共54家钢企，占比约83%。负债率在50%-59%的钢企一共有4家，占比约6%。负债率低于49%的钢企仅3家，占比5%，目前来看，这3家钢企安全性相对较高。（如表1所示）\r\n' +
        '表1:67家钢企负债率明细情况\r\n' +
        'GAN_GXUN_IMG:http://img08.mysteelcdn.com/wz/uploaded/glinfo/2015/10/20/133102.jpg;320x240\r\n' +
        '    数据来源：上海钢联钢材事业部\r\n' +
        '二、负债率与产能占比情况\r\n' +
        '本次调研的67家样本钢企产能总计6.89亿吨，通过统计分析发现，负债率高于100%的5家钢企共计产能1181.12万吨，占比约1.71%；负债率在90%-99%的2家钢企共计产能约701.97万吨，占比约1.02%；负债率在60%-89%的钢企，依旧是产能占比最高的，共计59140.36万吨，占比约85.82%；而负债率在50%-59%的钢企共计产能2904.95万吨，占比约4.22%；负债率在40%-49%的2家钢企共计产能4650.37万吨，占比约6.75%，这2家钢企年产能均超千万吨，可见年产能较高的钢企安全性相对偏高；负债率在30%-39%的仅一家钢企，产能为330.11万吨，占比不足1%。（如图2所示）\r\n' +
        '图2:67家钢企负债率产能占比\r\n' +
        'GAN_GXUN_IMG:http://img06.mysteelcdn.com/wz/uploaded/glinfo/2015/10/20/133118.jpg;487x294\r\n' +
        '    数据来源：上海钢联钢材事业部\r\n' +
        '三、从产能看钢企的负债率情况\r\n' +
        '从表2我们可以看出，年产能超过1000万吨的一共有22家钢企，负债率最高的为83%，最低的仅45%；产能在700万吨以上，不足1000万吨的一共17家钢企，负债率最高的为101%，最低的仅54%；产能在400万吨以上，不足700万吨的一共8家钢企，负债率最高的为95%，最低的仅68%；产能在300万吨以上，不足400万吨的一共10家钢企，负债率最高的为76%，最低的仅38%，安全性非常高；产能不足300万吨的钢企共10家，负债率最高的为143%，最低的60%，由此可见，产能低于100万吨的钢企是最危险的。\r\n' +
        '表2:67家钢企负债率情况\r\n' +
        'GAN_GXUN_IMG:http://img06.mysteelcdn.com/wz/uploaded/glinfo/2015/10/20/133133.jpg;320x194\r\n' +
        '    数据来源：上海钢联钢材事业部\r\n' +
        '四、从钢厂负债率角度推测未来淘汰的钢铁产能\r\n' +
        '以67家钢企总产能看，共计68908.88万吨，约占去年全年的83.81%，而负债率超100%的约为1181.12万吨，借此我们推测，未来最先可能淘汰约1409万吨产能；如果将负债率为90%以上的钢企也视为危险企业，那么可能淘汰约2244万吨；如果以不足100万吨钢企（负债率十分高，危险系数自然高）的情况看，未来可能至少有11家钢企率先面临淘汰。\r\n' +
        '钢企已经步入大浪淘沙阶段，剩者为王始见金已是不争的事实，希望大家迎难而上，用改革创新提升钢企创造力和竞争力，请相信曙光总在漫漫钢铁熊途后。（以上仅是我们基于现有可获得的信息做出的判断，随着影响因素的演变，我们的观点可能会有所修正，尽请及时关注。）（Mysteel.com资讯部编辑，未经许可，请勿转载）\r\n' +
        '责任编辑：周丽华021-2609349金雄林021-26093656\r\n' +
        'GAN_GXUN_IMG:http://img03.mysteelcdn.com/wz/uploaded/glinfo/2015/10/20/133151.jpg;600x346\r\n'
    }

    /*if ( query.callback )
        this.body = query.callback + "(" + JSON.stringify( rslt ) + ");";
    else
        this.body = JSON.stringify( rslt );*/
    console.log( JSON.stringify( rslt ) );
    ctx.body = JSON.stringify( rslt );
} );

app.listen( 7001 );